"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.

Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

with open('hw5-6.txt', encoding='utf-8') as f:
    lines = f.readlines()

lessons = {}
for line in lines:
    el = line.split()
    list_cnt_les = [int(num[:num.find('(')]) for num in el[1:] if '(' in num]
    sum_les = sum(list_cnt_les)
    lessons[el[0]] = sum_les

print(lessons)
